# -*- coding: utf-8 -*-

# Игра «Быки и коровы»
# https://goo.gl/Go2mb9
#
# Правила:
# Компьютер загадывает четырехзначное число, все цифры которого различны
# (первая цифра числа отлична от нуля). Игроку необходимо разгадать задуманное число.
# Игрок вводит четырехзначное число c неповторяющимися цифрами,
# компьютер сообщают о количестве «быков» и «коров» в названном числе
# «бык» — цифра есть в записи задуманного числа и стоит в той же позиции,
#       что и в задуманном числе
# «корова» — цифра есть в записи задуманного числа, но не стоит в той же позиции,
#       что и в задуманном числе
#
# Например, если задумано число 3275 и названо число 1234,
# получаем в названном числе одного «быка» и одну «корову».
# Очевидно, что число отгадано в том случае, если имеем 4 «быка».
#
# Формат ответа компьютера
# > быки - 1, коровы - 1


# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В этом модуле нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.
#
# В текущем модуле (lesson_006/01_mastermind.py) реализовать логику работы с пользователем:
#   модуль движка загадывает число
#   в цикле, пока число не отгадано
#       у пользователя запрашивается вариант числа
#       модуль движка проверяет число и выдает быков/коров
#       результат быков/коров выводится на консоль
#  когда игрок угадал таки число - показать количество ходов и вопрос "Хотите еще партию?"
#
# При написании кода учитывайте, что движок игры никак не должен взаимодействовать с пользователем.
# Все общение с пользователем делать в текущем модуле. Представьте, что движок игры могут использовать
# разные клиенты - веб, чатбот, приложение, етс - они знают как спрашивать и отвечать пользователю.
# Движок игры реализует только саму функциональность игры.
# Это пример применения SOLID принципа (см https://goo.gl/GFMoaI) в архитектуре программ.
# Точнее, в этом случае важен принцип единственной ответственности - https://goo.gl/rYb3hT

from mastermind_engine import get_all_answers, get_one_answers, input_number, check, del_bad_answers


print('Игра Быки и коровы')
answers = get_all_answers()
enemy = get_one_answers(answers)
player = input_number()

while True:
    print("=" * 15, "Ход игрока", "=" * 15)
    print("Угадайте число компьютера")
    number = input_number()
    bulls, cows = check(number, enemy)
    print("Быки: ", bulls, "Коровы: ", cows)
    if bulls == 4:
        print("Победил игрок")
        print("Компьютер загадал число: ", enemy)
        break

    print("=" * 15, "Ход компьютера", "=" * 15)
    enemy_try = get_one_answers(answers)
    print("Компьютер считает, что вы загадали число", enemy_try)
    bulls, cows = check(enemy_try, player)
    print("Быки: ", bulls, "Коровы: ", cows)
    if bulls == 4:
        print("Победил компьютер")
        print("Компьютер загадал число: ", enemy)
        break
    else:
        answers = del_bad_answers(answers, enemy_try, bulls, cows)
